{
  "backend/main.mo": "Main Motoko actor implementing the VCRM backend with access control, user approval, user profiles, and CRUD operations for leads, customers, deals, reminders, and solar projects.",
  "backend/migration.mo": "Migration module defining legacy actor state types and a run function that migrates old state by adding a null firstAdmin field.",
  "feature_evidence.json": "Feature evidence report mapping the VCRM logo display feature to its relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries for each frontend source file, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Global CSS file configuring Tailwind directives and defining light/dark theme CSS custom properties for the design system.",
  "frontend/index.html": "Root HTML entry point for the VCRM frontend, mounting the React app into a div#root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (login, dashboard, leads, customers, deals, reminders, solar projects, admin) and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/CustomerFormDialog.tsx": "Dialog form component for creating and editing customers with fields for name, email, phone, address, latitude, and longitude, using React Query mutations.",
  "frontend/src/components/DealCard.tsx": "Card component displaying a deal's title, customer name, and value with a dropdown menu for editing, deleting, and moving the deal between pipeline stages.",
  "frontend/src/components/DealFormDialog.tsx": "A modal dialog form for creating or editing a Deal, with fields for title, value, customer selection, and stage. Uses React Query mutations to add or update deals and shows toast notifications on success or failure.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "A reusable alert dialog that asks the user to confirm deletion of a named entity, with Cancel and Delete buttons and an optional loading state.",
  "frontend/src/components/Layout.tsx": "The main application shell that renders a responsive sidebar with navigation links, theme toggle, admin/approval controls, and an outlet for child routes. Redirects unauthenticated users to login and shows a profile setup modal when no profile exists.",
  "frontend/src/components/LeadFormDialog.tsx": "A modal dialog form for creating or editing a Lead, with fields for name, contact, status, and notes. Uses React Query mutations and displays toast notifications on success or failure.",
  "frontend/src/components/ProfileSetupModal.tsx": "A non-dismissible modal dialog that prompts a new user to enter their name and email to create their profile on first login. Calls the saveCallerUserProfile mutation and shows a success or error toast.",
  "frontend/src/components/ReminderFormDialog.tsx": "A modal dialog form for creating or editing a Reminder, with a datetime-local input and a note textarea, converting between nanosecond bigints and JS dates. Uses React Query mutations and shows toast notifications.",
  "frontend/src/components/SolarProjectFormDialog.tsx": "A modal dialog form for creating or editing a SolarProject, with fields for customer, system size, installation status, survey date, surveyor name, and notes. Uses React Query mutations and converts date values between nanosecond bigints and date strings.",
  "frontend/src/components/StaticMapWidget.tsx": "A React component that renders a static SVG-based world map grid with a draggable pin positioned based on latitude/longitude coordinates, falling back to a 'No coordinates set' message when coords are zero.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for CRUD operations on backend entities (user profiles, leads, customers, deals, reminders, solar projects, and admin functions) using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines light/dark mode CSS custom properties for the design system's color tokens and sidebar theming.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AccessDeniedPage.tsx": "A full-page error screen displayed when a user lacks permission to access a route, with a button to navigate back to the dashboard.",
  "frontend/src/pages/AdminPage.tsx": "An admin-only page that displays system stats, lists pending user approvals with approve/reject actions, and allows role assignment via dropdowns, guarded by an admin check.",
  "frontend/src/pages/CustomerDetailPage.tsx": "Displays a single customer's details including contact info, associated projects, and a map widget, with options to edit or delete the customer.",
  "frontend/src/pages/CustomersPage.tsx": "Lists all customers in a searchable grid with options to add, edit, delete, or navigate to individual customer detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a CRM overview dashboard with stat cards, a deal pipeline bar chart, and a solar project status pie chart using data from multiple query hooks.",
  "frontend/src/pages/DealsPage.tsx": "Renders a Kanban-style deal pipeline board grouped by stage (New, In Progress, Won, Lost) with search, stage movement, and delete functionality.",
  "frontend/src/pages/LeadsPage.tsx": "Displays a searchable, filterable grid of leads with status badges and options to add, edit, or delete leads via dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication that redirects authenticated users to the dashboard, featuring a two-panel layout with feature highlights and a sign-in card.",
  "frontend/src/pages/RemindersPage.tsx": "Reminders list page with search, filter (all/overdue/upcoming), add/edit/delete functionality, and overdue count display using query hooks.",
  "frontend/src/pages/SolarProjectDetailPage.tsx": "Detail view for a single solar project showing project info, customer, status, and a map widget, with edit and delete actions.",
  "frontend/src/pages/SolarProjectsPage.tsx": "Solar projects list page with search, status filter, and CRUD operations (add/edit/delete) displayed as cards with customer and date info.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens (including sidebar, navy, orange), border radius, box shadows, and accordion animations.",
  "project_state.json": "Tracks the VCRM project state including version, feature list, architectural notes, and requirements for a React/TypeScript + Motoko CRM app on the Internet Computer with solar project management features."
}