{
  "backend/main.mo": "Main Motoko actor implementing OTP-based authentication (generate/verify), user role assignment, and first-admin bootstrapping using email-to-principal mappings and access control mixins.",
  "feature_evidence.json": "Feature evidence report linking the ProfileSetupModal fix (correct `saveCallerUserProfile` invocation, fresh actor reference, error handling) to its relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON catalog of short summaries for all frontend source files, describing the purpose of each page, component, hook, and style file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark theme color tokens (background, foreground, sidebar, charts, etc.).",
  "frontend/index.html": "Minimal HTML shell for the VCRM app that mounts the React root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that defines the TanStack Router route tree for all app pages (login, dashboard, leads, customers, deals, reminders, solar projects, admin, profile) and renders a loading spinner while the identity initializes.",
  "frontend/src/components/CustomerFormDialog.tsx": "Dialog form component for creating and editing customer records with fields for name, email, phone, address, latitude, and longitude, using React Query mutations and toast notifications.",
  "frontend/src/components/DealCard.tsx": "Card component displaying a deal's title, customer name, and value with a dropdown menu for editing, deleting, and moving the deal to another pipeline stage.",
  "frontend/src/components/DealFormDialog.tsx": "A modal dialog component for creating and editing deals, with fields for title, value, customer selection, and stage. Uses React Query mutations to add or update deals and shows toast notifications on success or failure.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "A reusable alert dialog that prompts the user to confirm deletion of a named entity, with Cancel and Delete buttons and an optional loading state.",
  "frontend/src/components/Layout.tsx": "The main application shell that renders a sidebar navigation with route links, handles authentication redirects, shows loading states, and conditionally displays a profile setup modal or an approval-pending screen based on user status.",
  "frontend/src/components/LeadFormDialog.tsx": "A modal dialog for creating and editing leads, with fields for name, contact, status, and notes. Submits via React Query mutations and displays toast notifications for success or failure.",
  "frontend/src/components/ProfileSetupModal.tsx": "A non-dismissible modal that collects a new user's name, email, and phone to create their profile on first login, showing actor connection status, submission progress, and inline error messages.",
  "frontend/src/components/ReminderFormDialog.tsx": "A modal dialog for creating and editing reminders with a datetime-local due date and a note field, converting between nanosecond bigints and datetime strings before submitting via React Query mutations.",
  "frontend/src/components/SolarProjectFormDialog.tsx": "A dialog form component for creating or editing a solar project, handling fields like customer, system size, installation status, and site survey details using React state and mutation hooks.",
  "frontend/src/components/StaticMapWidget.tsx": "A purely visual map widget that renders a styled grid with continent-like shapes and a pin marker positioned based on provided latitude/longitude coordinates.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including OTP auth, user profiles, dashboard stats, leads, customers, deals, reminders, and solar projects.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines light/dark mode CSS custom properties for the design system's color tokens and sidebar theming.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AccessDeniedPage.tsx": "A full-page error screen displayed when a user lacks permission, showing a message and a button to navigate back to the dashboard.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that displays system stats, user approvals, and role management. Restricts access to admin users and provides UI for approving/rejecting users and assigning roles.",
  "frontend/src/pages/CustomerDetailPage.tsx": "Detail view for a single customer showing contact info, associated projects, and a static map widget. Supports editing and deleting the customer via dialogs.",
  "frontend/src/pages/CustomersPage.tsx": "Paginated, searchable list of all customers displayed in a card grid. Supports adding, editing, and deleting customers via dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing CRM summary stats, a deal pipeline bar chart, and a solar project status pie chart using Recharts.",
  "frontend/src/pages/DealsPage.tsx": "Kanban-style deal pipeline page organized by deal stage (New, In Progress, Won, Lost) with search, stage movement, and delete functionality.",
  "frontend/src/pages/LeadsPage.tsx": "Displays a filterable, searchable grid of CRM leads with status badges, and supports adding, editing, and deleting leads via dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Implements a two-step email OTP login flow with a countdown timer, redirecting authenticated users to the dashboard.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile with inline editing and an OTP re-verification modal for email changes, displaying admin/approval status badges.",
  "frontend/src/pages/RemindersPage.tsx": "Lists reminders with search and all/overdue/upcoming filters, supporting add, edit, delete, and mark-as-overdue actions.",
  "frontend/src/pages/SolarProjectDetailPage.tsx": "Shows detailed information for a single solar project including status, customer, and a map widget, with edit and delete capabilities.",
  "frontend/src/pages/SolarProjectsPage.tsx": "React page component that lists all solar projects with search and status filtering, and supports creating, editing, and deleting projects via dialogs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens, border radii, box shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking a fix request for the ProfileSetupModal's 'Unable to save profile' error, listing known issues, existing feature fixes, and a pending backend fix for `saveCallerUserProfile`."
}