{
  "backend/main.mo": "Main Motoko actor defining all CRM data types (Lead, Deal, Customer, Reminder, SolarProject, etc.), actor state (maps and counters), and integrating access control, user approval, and authorization mixins.",
  "backend/migration.mo": "Defines the canonical State type for all backend data and provides a no-op migration function that passes state through unchanged.",
  "feature_evidence.json": "JSON report mapping implemented feature IDs (sidebar visibility fixes, dashboard real data, pipeline real data, functional action buttons, etc.) to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of each frontend source file, describing the purpose and key behaviors of pages, components, hooks, and styles.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, sidebar, chart, and destructive colors.",
  "frontend/index.html": "Minimal HTML shell for the VCRM React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Defines the full TanStack Router route tree with public (login) and protected (layout-wrapped) routes for all CRM pages, wrapped in QueryClient and ThemeProvider providers.",
  "frontend/src/components/AddLeadModal.tsx": "A modal dialog for quickly adding a new lead with name, phone (required), and email fields, using the useAddLead mutation and showing toast notifications on success or failure.",
  "frontend/src/components/CustomerFormDialog.tsx": "A dialog form for adding or editing a customer (name, email, phone, address, coordinates), but currently shows an info toast and closes without performing any backend operation.",
  "frontend/src/components/DealCard.tsx": "A card component displaying a deal's title, customer name, and value, with a dropdown menu for editing, deleting, or moving the deal to another pipeline stage.",
  "frontend/src/components/DealFormDialog.tsx": "A dialog form for creating or editing a deal with title, value, lead/contact selector, and stage fields, using useAddDeal and useUpdateDeal mutations.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "A reusable alert dialog that prompts the user to confirm deletion of a named entity, with a loading spinner state and destructive-styled confirm button.",
  "frontend/src/components/Layout.tsx": "The main application shell with a responsive sidebar navigation (including nested 'Other Services' items), sign-out logic, and a profile setup modal trigger for users without a configured profile.",
  "frontend/src/components/LeadFormDialog.tsx": "A dialog form for creating or editing a lead with name, contact, status (select), and notes fields, using useAddLead and useUpdateLead mutations.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for setting up a user profile with name, email, and phone fields, including client-side validation, categorized error handling, and a mutation hook to save the profile to the backend.",
  "frontend/src/components/ReminderFormDialog.tsx": "A dialog form for adding or editing a reminder with due date and note fields; submission is stubbed out with a toast notification indicating reminders are unavailable in this version.",
  "frontend/src/components/RoleAssignmentOTPDialog.tsx": "Empty file with no content.",
  "frontend/src/components/SolarProjectFormDialog.tsx": "A dialog form for creating or editing a solar project (system size, surveyor name, survey notes); submission is stubbed out with a toast notification indicating the feature is unavailable.",
  "frontend/src/components/StaticMapWidget.tsx": "A purely visual map widget that renders a styled SVG grid with continent shapes and a pin marker positioned from latitude/longitude coordinates, with no external map API dependency.",
  "frontend/src/components/UploadExcelSheetModal.tsx": "A UI-only modal for uploading Excel/CSV files via drag-and-drop or file browse, with all interactions stubbed to show a toast notification indicating no actual processing occurs.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to the React component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, OTP auth, leads, deals, and admin approval operations using the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines CSS custom properties for light/dark theme tokens including colors, sidebar, and chart variables.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Full-page error component shown when a user lacks permission, with a button to navigate back to the dashboard.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that lists users by approval status (pending/approved/rejected) and allows a super admin to approve or reject them via tabbed UI.",
  "frontend/src/pages/ContactsPage.tsx": "Leads/contacts management page with search, add, edit, and delete functionality backed by backend query hooks and displayed in a card grid.",
  "frontend/src/pages/CustomerDetailPage.tsx": "Placeholder detail page for a single customer showing contact info fields, with a note that customer management is unavailable in this version.",
  "frontend/src/pages/CustomersPage.tsx": "Local-state customers list page with search, add, edit, delete, and view navigation, using a card grid layout without backend persistence.",
  "frontend/src/pages/DashboardPage.tsx": "Displays a CRM dashboard with summary stat cards (total leads, deals, won deals, revenue) and Recharts bar/pie charts showing deals by stage and leads by status.",
  "frontend/src/pages/DealsPage.tsx": "Renders a Kanban-style sales pipeline board with four deal stages, supporting add/edit/delete deals and moving deals between stages.",
  "frontend/src/pages/FollowupDetailsPage.tsx": "Shows a paginated table of all leads with their status, name, contact, and notes, with navigation back to the lead summary page.",
  "frontend/src/pages/LeadsPage.tsx": "Lists all CRM leads in a card grid with search and status filtering, and supports adding, editing, and deleting leads via dialogs.",
  "frontend/src/pages/LeadSummaryReportPage.tsx": "Provides a searchable, filterable lead summary report table with row selection, bulk actions, and download controls.",
  "frontend/src/pages/LoginPage.tsx": "Implements a two-step OTP login flow (email entry then OTP verification) using a backend actor, with localStorage-based auth state helpers and navigation to the dashboard on success.",
  "frontend/src/pages/PipelinePage.tsx": "Displays a sales pipeline view with a lead funnel, tags pie chart, and campaign list, fetching sample data via React Query hooks and providing navigation to lead summary and campaign creation.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and allows editing of the authenticated user's profile (name, email, phone) with an OTP email verification dialog, and displays admin/approval status badges.",
  "frontend/src/pages/RemindersPage.tsx": "Manages a local list of reminders with search, overdue/upcoming filters, add/edit via a form dialog, and delete confirmation, displaying due dates and overdue indicators.",
  "frontend/src/pages/ReportsPage.tsx": "Placeholder page for a future Reports section, displaying a 'Coming Soon' message with a bar chart icon.",
  "frontend/src/pages/SolarProjectDetailPage.tsx": "Placeholder detail page for a solar project identified by URL param, showing a stub card and a back-navigation button.",
  "frontend/src/pages/SolarProjectsPage.tsx": "Lists solar projects stored in local state with search and status filtering, supporting add/edit via a form dialog and delete confirmation, displayed in a responsive card grid.",
  "frontend/src/pages/TemplatesPage.tsx": "Placeholder page for a future Templates section (WhatsApp, SMS, email), displaying a 'Coming Soon' message with a file-text icon.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via OKLCH variables, fonts, border radius, shadows, animations) and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracker for a Motoko-backed CRM app (NIRMALA SOL), recording known issues, existing features, and pending feature requests such as sidebar visibility fixes, real backend data, and functional action buttons."
}