{
  "backend/main.mo": "Main Motoko actor implementing the VCRM backend with access control, user approval, user profiles, and CRM data types (leads, customers, deals, reminders, solar projects). Handles bootstrapping the first admin and enforcing role-based permissions for all operations.",
  "feature_evidence.json": "Feature evidence report documenting two fixes: removing the false 'Authentication failed' error banner in ProfileSetupModal.tsx and fixing the useSaveCallerUserProfile mutation in useQueries.ts to use a fresh actor reference with an 'actor_not_ready' error distinction.",
  "frontend-file-summaries.txt": "JSON mapping of frontend source file paths to short summaries describing each component or page's purpose, used as a reference for build planning.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the VCRM React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes (login, dashboard, leads, customers, deals, reminders, solar projects, admin), wraps the app in ThemeProvider, and shows a loading spinner during Internet Identity initialization.",
  "frontend/src/components/CustomerFormDialog.tsx": "Dialog form component for creating and editing customer records with fields for name, email, phone, address, latitude, and longitude, using React Query mutations and toast notifications.",
  "frontend/src/components/DealCard.tsx": "Renders a single deal card with title, customer name, and value, plus a dropdown menu for editing, deleting, or moving the deal to another pipeline stage.",
  "frontend/src/components/DealFormDialog.tsx": "Modal dialog form for creating or editing a deal, with fields for title, value, customer selection, and stage, using React Query mutations and toast notifications.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "Reusable alert dialog that prompts the user to confirm deletion of a named entity, with confirm/cancel buttons and an optional loading state.",
  "frontend/src/components/Layout.tsx": "Main application shell that handles authentication guards, profile setup, admin/approval status checks, sidebar navigation with overdue reminder badge, and theme toggling.",
  "frontend/src/components/LeadFormDialog.tsx": "Modal dialog form for creating or editing a lead, with fields for name, contact, status, and notes, using React Query mutations and toast notifications.",
  "frontend/src/components/ProfileSetupModal.tsx": "Onboarding modal that collects a new user's name and email to create their profile, handling actor readiness delays, timeouts, and inline error display.",
  "frontend/src/components/ReminderFormDialog.tsx": "Modal dialog form for creating or editing a reminder, converting between datetime-local strings and nanosecond bigints for the due date field.",
  "frontend/src/components/SolarProjectFormDialog.tsx": "A dialog form component for creating or editing a solar project, handling fields like customer, system size, installation status, and site survey details using React state and mutation hooks.",
  "frontend/src/components/StaticMapWidget.tsx": "A purely visual map widget that renders a styled grid with continent-like shapes and a pin marker positioned based on provided latitude/longitude coordinates.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including user profiles, leads, customers, deals, reminders, solar projects, and dashboard stats.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines light/dark mode CSS custom properties for the design system including colors, sidebar, and chart tokens.",
  "frontend/src/lib/utils.ts": "Exports a single cn utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDeniedPage.tsx": "A full-page error view displayed when a user lacks permission to access a route, with a button to navigate back to the dashboard.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that displays system stats, user approvals, and role management. Restricts access to admin users and provides UI for approving/rejecting users and assigning roles.",
  "frontend/src/pages/CustomerDetailPage.tsx": "Detail view for a single customer showing contact info, associated projects, and a map widget. Supports editing and deleting the customer via dialogs.",
  "frontend/src/pages/CustomersPage.tsx": "Paginated, searchable list of all customers displayed as cards. Supports adding, editing, and deleting customers via dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing CRM summary stats, a deal pipeline bar chart, and a solar project status pie chart using Recharts.",
  "frontend/src/pages/DealsPage.tsx": "Kanban-style deal pipeline page organized by deal stage (New, In Progress, Won, Lost). Supports searching, adding, moving, and deleting deals.",
  "frontend/src/pages/LeadsPage.tsx": "Displays a filterable, searchable grid of CRM leads with status badges, and supports adding, editing, and deleting leads via dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with an Internet Identity sign-in button, a feature highlights panel, and redirects authenticated users to the dashboard.",
  "frontend/src/pages/RemindersPage.tsx": "Shows a list of reminders with search and overdue/upcoming filters, and supports creating, editing, deleting, and marking reminders as overdue.",
  "frontend/src/pages/SolarProjectDetailPage.tsx": "Displays detailed information for a single solar project including customer info, status, site survey data, and a map widget, with edit and delete actions.",
  "frontend/src/pages/SolarProjectsPage.tsx": "Lists all solar projects with search and status filtering, showing customer and surveyor info, and supports creating, editing, and deleting projects.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest for VCRM, a React/TypeScript + Motoko CRM app on the Internet Computer, tracking versioned features, known auth session issues, and architectural notes."
}