{
  "backend/main.mo": "Main Motoko actor implementing OTP-based email authentication, user session management, super admin tracking, and user approval workflows with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—auth guard fix for admin/super-admin bypass and admin panel page—to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one- to two-sentence summaries of all frontend source files, describing each component's or page's purpose and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the VCRM React app, mounting the app into a root div and loading the TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (login, dashboard, leads, customers, deals, reminders, solar projects, admin, etc.) wrapped in QueryClient and ThemeProvider.",
  "frontend/src/components/CustomerFormDialog.tsx": "Dialog form component for creating and editing customers with fields for name, email, phone, address, latitude, and longitude, using React Query mutations for backend persistence.",
  "frontend/src/components/DealCard.tsx": "Card component displaying a deal's title, customer name, and value with a dropdown menu for editing, deleting, and moving the deal to other pipeline stages.",
  "frontend/src/components/DealFormDialog.tsx": "A modal dialog component for creating and editing deals, with fields for title, value, customer selection, and stage. Uses React Query mutations to add or update deals and shows toast notifications on success or failure.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "A reusable alert dialog that prompts the user to confirm deletion of a named entity, with Cancel and Delete buttons and an optional loading state.",
  "frontend/src/components/Layout.tsx": "The main application shell that renders a sidebar with navigation links, handles authentication checks, role/approval-based access control, and provides sign-out functionality.",
  "frontend/src/components/LeadFormDialog.tsx": "A modal dialog for creating and editing leads with fields for name, contact, status, and notes, using React Query mutations and toast notifications.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects and saves a user's profile (name, email, phone) with client-side validation, categorized error handling, and contextual error icons.",
  "frontend/src/components/ReminderFormDialog.tsx": "A modal dialog for creating and editing reminders with a datetime-local due date and a note field, converting between nanosecond bigints and datetime strings.",
  "frontend/src/components/RoleAssignmentOTPDialog.tsx": "An empty file with no content, likely a placeholder for a role assignment OTP dialog component.",
  "frontend/src/components/SolarProjectFormDialog.tsx": "A dialog form component for creating or editing a solar project, handling fields like customer, system size, installation status, and site survey details using React state and mutation hooks.",
  "frontend/src/components/StaticMapWidget.tsx": "A purely visual map widget that renders a styled grid with continent shapes and a pin marker positioned based on provided latitude/longitude coordinates, with a fallback message when no coordinates are set.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering OTP, auth/roles, user profiles, leads, customers, deals, reminders, and solar projects.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines light/dark mode CSS custom properties for the design system including colors, sidebar, and chart tokens.",
  "frontend/src/lib/utils.ts": "Exports a single cn utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AccessDeniedPage.tsx": "A full-page error screen displayed when a user lacks permission to access a route, with a back-to-dashboard navigation button.",
  "frontend/src/pages/AdminPage.tsx": "Admin page for managing user approvals, allowing super admins to approve or reject pending users and view approved/rejected users with their profile details.",
  "frontend/src/pages/CustomerDetailPage.tsx": "Detail view for a single customer showing contact info, associated projects, a static map widget, and options to edit or delete the customer.",
  "frontend/src/pages/CustomersPage.tsx": "Paginated list page for all customers with search filtering, add/edit/delete actions via dialogs, and a card-based grid layout.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard overview page displaying CRM stat cards, a deal pipeline bar chart, and a solar project status pie chart using Recharts.",
  "frontend/src/pages/DealsPage.tsx": "Kanban-style deal pipeline page organized by deal stages (New, In Progress, Won, Lost) with search, stage movement, and delete functionality.",
  "frontend/src/pages/LeadsPage.tsx": "Displays a filterable, searchable grid of CRM leads with status badges, and supports adding, editing, and deleting leads via dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Implements a two-step OTP-based login flow (email entry then OTP verification) using a backend actor, storing auth state in localStorage and redirecting to the dashboard on success.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile with inline editing, OTP re-verification for email changes, and displays admin/approval status badges.",
  "frontend/src/pages/RemindersPage.tsx": "Lists reminders with search and filter controls (all/overdue/upcoming), and supports creating, editing, deleting, and marking reminders as overdue.",
  "frontend/src/pages/SolarProjectDetailPage.tsx": "Shows detailed information for a single solar project including customer info, status, and a map widget, with options to edit or delete the project.",
  "frontend/src/pages/SolarProjectsPage.tsx": "React page that lists all solar projects with search and status filtering, and supports creating, editing, and deleting projects via dialogs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL query parameters (supporting both regular and hash-based routing), persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts, OKLCH-based color tokens, border radii, box shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest describing the VCRM Solar CRM app's architecture, known issues, existing features, and pending feature requests centered on Gmail OTP login, Super Admin auto-approval for vcrm.com@gmail.com, and an Admin Panel for user approval management."
}