{
  "backend/main.mo": "Main ICP actor implementing OTP-based authentication (generate/verify OTP, email-to-principal mapping), user profile CRUD, and CRM entity management (leads, customers, deals, reminders, solar projects) with role-based access control and user approval.",
  "backend/migration.mo": "Data migration module that upgrades user profiles from an old schema (email, name) to a new schema (email, name, phone) by adding an empty phone field.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (OTP login UI, profile page, React Query hooks) to their affected files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's React components and pages.",
  "frontend/index.css": "Global Tailwind CSS base styles defining OKLCH color tokens for light and dark themes, including background, foreground, sidebar, chart, and UI component color variables.",
  "frontend/index.html": "Minimal HTML entry point for the VCRM React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application component that defines all TanStack Router routes (login, dashboard, leads, customers, deals, reminders, solar projects, admin, profile) with a protected layout wrapper and an initialization loading state.",
  "frontend/src/components/CustomerFormDialog.tsx": "Dialog form component for creating and editing customers with fields for name, email, phone, address, latitude, and longitude, using React Query mutations for backend calls.",
  "frontend/src/components/DealCard.tsx": "Renders a deal card with title, customer name, and value, plus a dropdown menu for editing, deleting, or moving the deal to another pipeline stage.",
  "frontend/src/components/DealFormDialog.tsx": "Modal dialog form for creating or editing a deal, with fields for title, value, customer selection, and stage, using React Query mutations for persistence.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "Reusable alert dialog that prompts the user to confirm deletion of a named entity, with confirm and cancel actions and an optional loading state.",
  "frontend/src/components/Layout.tsx": "Main application shell that handles authentication guards, profile setup, admin/approval status checks, and renders the sidebar navigation with theme toggle and logout.",
  "frontend/src/components/LeadFormDialog.tsx": "Modal dialog form for creating or editing a lead, with fields for name, contact, status, and notes, using React Query mutations for persistence.",
  "frontend/src/components/ProfileSetupModal.tsx": "Onboarding modal that collects a new user's name, email, and phone to create their profile, handling actor readiness and retry logic before saving via a React Query mutation.",
  "frontend/src/components/ReminderFormDialog.tsx": "Modal dialog form for creating or editing a reminder, converting between datetime-local strings and nanosecond bigints for due date storage.",
  "frontend/src/components/SolarProjectFormDialog.tsx": "A dialog form component for creating or editing a solar project, handling fields like customer, system size, installation status, and site survey details using React state and mutation hooks.",
  "frontend/src/components/StaticMapWidget.tsx": "A purely visual map widget that renders a styled grid with continent-like shapes and a pin marker positioned based on provided latitude/longitude coordinates.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for data fetching and mutations against the backend, covering OTP auth, user profiles, leads, customers, deals, reminders, solar projects, and admin approval workflows.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines light/dark mode CSS custom properties for the design system's color tokens and sidebar theming.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AccessDeniedPage.tsx": "A full-page error screen displayed when a user lacks permission, showing a shield icon, message, and a button to navigate back to the dashboard.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that displays system stats, user approvals, and role management. Restricts access to admin users and provides UI for approving/rejecting users and assigning roles.",
  "frontend/src/pages/CustomerDetailPage.tsx": "Detail view for a single customer showing contact info, a static map, and associated projects. Supports editing and deleting the customer via dialogs.",
  "frontend/src/pages/CustomersPage.tsx": "Paginated, searchable list of all customers displayed in a card grid. Supports adding, editing, and deleting customers via dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing CRM summary stats, a deal pipeline bar chart, and a solar project status pie chart. Aggregates data from leads, deals, and solar projects.",
  "frontend/src/pages/DealsPage.tsx": "Kanban-style deal pipeline page organized by deal stages (New, In Progress, Won, Lost). Supports searching, adding, editing, deleting, and moving deals between stages.",
  "frontend/src/pages/LeadsPage.tsx": "Displays a filterable, searchable grid of CRM leads with status badges, and supports adding, editing, and deleting leads via dialogs.",
  "frontend/src/pages/LoginPage.tsx": "Two-step login page that collects an email, sends an OTP via mutation, verifies it, and redirects authenticated users to the dashboard.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page allowing viewing and editing of name, email, and phone, with OTP re-verification flow for email changes and admin/approval status display.",
  "frontend/src/pages/RemindersPage.tsx": "Lists reminders with search and all/overdue/upcoming filters, and supports creating, editing, deleting, and marking reminders as overdue.",
  "frontend/src/pages/SolarProjectDetailPage.tsx": "Detail view for a single solar project showing installation status, customer info, and a map widget, with edit and delete actions.",
  "frontend/src/pages/SolarProjectsPage.tsx": "React page that lists, filters, creates, edits, and deletes solar projects, displaying project cards with customer info, installation status badges, and date formatting.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read URL/hash query parameters, persist them in sessionStorage, and clean sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Inter, Plus Jakarta Sans), OKLCH-based design tokens for colors, border radii, shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 33) describing the VCRM app's architecture, existing features, known issues, and build summary for a React/TypeScript frontend with a Motoko canister backend on the Internet Computer."
}