{
  "kind": "build_request",
  "title": "Fix 'Authentication failed. Please log out and log in again.' error in Profile Setup Modal",
  "projectName": "VCRM",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "In ProfileSetupModal.tsx, eliminate the 'Authentication failed. Please log out and log in again.' error banner that appears when the user submits the profile setup form with a valid Internet Identity session. The modal must not show any authentication error to a user who is actively authenticated. On form submission, if the actor is null or unavailable, silently wait for the actor to be ready (up to a reasonable timeout) before invoking saveCallerUserProfile. If the call still fails, surface a generic retry message — never the 'Authentication failed' or 'Log out and try again' text — unless the identity is genuinely expired.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Authentication failed. Please log out and log in again.",
          "Log out and try again fix kare kya kar rahe hai ap"
        ]
      },
      "acceptanceCriteria": [
        "A user with a valid Internet Identity session who fills in Full Name and Email and clicks 'Save Profile & Continue' does NOT see the 'Authentication failed. Please log out and log in again.' error.",
        "The 'Log out and try again' link is never shown to a user with an active, authenticated session.",
        "If the actor is momentarily unavailable at submission time, the modal retries silently before displaying any error.",
        "On successful saveCallerUserProfile call, the modal closes and the user is redirected to the dashboard.",
        "If the call genuinely fails after retry, a neutral error message is shown (e.g., 'Unable to save profile. Please try again.') without referencing session expiry or authentication failure."
      ]
    },
    {
      "id": "REQ-25",
      "text": "In useQueries.ts, fix the useSaveCallerUserProfile mutation so that it obtains a fresh actor reference at call time rather than relying on a potentially stale closure. Before calling saveCallerUserProfile, confirm the actor is non-null and the identity is authenticated. If the actor is unavailable, throw an error clearly labeled 'actor_not_ready' (not 'session_expired') so ProfileSetupModal.tsx can distinguish and handle it without showing false authentication failure messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Authentication failed. Please log out and log in again."
        ]
      },
      "acceptanceCriteria": [
        "The mutation always fetches the latest actor instance at invocation time.",
        "Errors are typed/labeled so the modal can distinguish 'actor not ready' from 'session expired'.",
        "No 'Authentication failed' error is thrown when the user has a valid active session.",
        "The mutation succeeds and returns the expected result when the actor is available and the user is authenticated."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths.",
    "Do not change any backend Motoko logic unless strictly necessary to resolve the authentication error.",
    "The 'Log out and try again' UI element must never be shown to users with a valid active Internet Identity session."
  ],
  "nonGoals": [
    "Redesigning the Profile Setup Modal layout or visual style.",
    "Changing the Internet Identity authentication flow itself.",
    "Adding new CRM features or modifying existing data models."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}