{
  "kind": "build_request",
  "title": "Fix sidebar text visibility, real backend data, working buttons, remove Refer & Earn",
  "projectName": "Nirmala SOL CRM",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix sidebar text and icon visibility: all navigation labels (Dashboard, Contacts, Pipeline, Templates, Reports, Other Services, Admin, Settings, Sign Out) must render in white or light-colored text/icons so they are clearly readable against the purple sidebar background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-screenshot",
          "msg-text-visible"
        ],
        "quotes": [
          "TEXT bijabal nahi hai",
          "Sidebar text visible - White/light colored text jo purple background par clearly dikhe"
        ]
      },
      "acceptanceCriteria": [
        "All sidebar menu item labels are white or light-colored and clearly legible against the purple background",
        "Icons beside each menu item are also light-colored and visible",
        "Active/selected menu item has a visually distinct highlight that remains readable"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the 'Refer & Earn' menu item completely from the sidebar navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-refer-earn-remove"
        ],
        "quotes": [
          "Refer & Earn remove kare"
        ]
      },
      "acceptanceCriteria": [
        "Sidebar does not contain a 'Refer & Earn' link or section",
        "Remaining sidebar items are: Dashboard, Contacts, Pipeline, Templates, Reports, Other Services, Admin, Settings, Sign Out"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement persistent backend storage in the Motoko canister for all core CRM entities: leads/contacts, deals, and pipeline stages. All CRUD operations (create, read, update, delete) must persist data across sessions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-real-data"
        ],
        "quotes": [
          "Data Storage - yeh data permanently save ho (backend mein store ho)"
        ]
      },
      "acceptanceCriteria": [
        "Leads/contacts added by the user are stored in stable backend state and survive canister upgrades",
        "Deals added by the user are stored in stable backend state",
        "All data is retrievable via query calls and returns only user-entered records"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Dashboard must display only real data fetched from the backend. All metrics (lead count, deal count, pipeline stats, etc.) must start at 0 when no data has been entered and automatically update as data is added.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-real-data"
        ],
        "quotes": [
          "Dashboard mein sirf actual entered data dikhega (shuruat mein 0)",
          "jaise-jaise data add ho waise-waise update ho"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard shows 0 for all counters and charts on a fresh start with no data",
        "After adding a lead or deal, the dashboard stats reflect the new totals without a full page reload",
        "No hardcoded or sample/mock data is displayed on the dashboard"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Pipeline page must display only deals that have been actually added by the user, fetched from the backend. It must start empty and update automatically when new deals are added.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-real-data"
        ],
        "quotes": [
          "Pipeline mein sirf added deals dikhengi",
          "jaise-jaise data add ho waise-waise update ho"
        ]
      },
      "acceptanceCriteria": [
        "Pipeline board is empty when no deals have been added",
        "Deals appear in the correct stage column after being added",
        "No hardcoded or sample deals are shown",
        "Moving a deal between stages updates the backend and is reflected immediately"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Make all action buttons fully functional: 'Add Contact', 'Add Lead', 'Add Deal', and any other create/edit/delete buttons must open their respective forms, submit data to the backend, and reflect changes in the UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-buttons-not-working"
        ],
        "quotes": [
          "ye sare button kam nahi kar raha hai",
          "All Buttons Working - Add Contact, Add Deal, sabhi buttons properly kaam karenge"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Add Contact' opens the contact/lead form dialog and successfully saves to the backend",
        "Clicking 'Add Deal' opens the deal form dialog and successfully saves to the backend",
        "Edit and delete buttons on leads, contacts, and deals all work correctly",
        "Success/error toast notifications appear after form submissions",
        "Lists and counters update immediately after any create/edit/delete action"
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths",
    "Keep all Motoko logic in backend/main.mo single actor",
    "Sidebar navigation items must remain: Dashboard, Contacts, Pipeline, Templates, Reports, Other Services, Admin, Settings, Sign Out (no Refer & Earn)"
  ],
  "nonGoals": [
    "Templates page full implementation (placeholder is acceptable)",
    "Reports page full implementation (placeholder is acceptable)",
    "Other Services page full implementation",
    "Real-time WebSocket updates (React Query polling or manual refetch is sufficient)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}