{
  "kind": "coverage_report",
  "version": "1.0",
  "generatedAt": "2026-02-25T18:34:58.008Z",
  "sources": {
    "buildRequest": true,
    "implementationPlan": true
  },
  "requirements": {
    "total": 5,
    "implemented": 3,
    "items": [
      {
        "id": "REQ-45",
        "summary": "In the Motoko backend (backend/main.mo), implement an OTP (One-Time Password) authentication system. Add functions to: (1) generateOTP(email: Text) — generate a 6-digit numeric OTP, store it against the email with a 10-minute expiry timestamp, and return the OTP (the frontend will display/simulate delivery since email sending is not supported); (2) verifyOTP(email: Text, otp: Text) — validate the OTP against the stored value and expiry, return a result indicating success or failure with a reason; (3) on successful OTP verification, look up or create a user profile keyed by the verified email, applying the existing first-user auto-admin logic. Remove or retain Internet Identity as a secondary option but OTP must be the primary login path.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-46",
        "summary": "Replace the existing Internet Identity login page (frontend/src/pages/LoginPage.tsx) with a professional OTP-based login UI. The page must have two steps: Step 1 — an email input field with a 'Send OTP' button; Step 2 — a 6-digit OTP input (individual digit boxes or a single input) with a 'Verify OTP' countdown timer (10 minutes), a 'Resend OTP' link, and a 'Verify' button. Display the generated OTP inline (simulated delivery) in a highlighted info banner since real email delivery is not available. On successful verification, store the session (email + verified status) and redirect to the dashboard or Profile Setup if the profile is incomplete. Apply the existing emerald green and dark teal brand theme consistently.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/pages/LoginPage.tsx"
        ],
        "matchedFiles": [
          "frontend/src/pages/LoginPage.tsx"
        ]
      },
      {
        "id": "REQ-47",
        "summary": "In the Motoko backend (backend/main.mo), add or update user profile management functions to support a richer profile: (1) getCallerUserProfile — return the authenticated caller's profile including name, email, phone (optional), role, approvalStatus, and joinDate; (2) updateCallerUserProfile(name: Text, email: Text, phone: Text) — update the caller's profile fields and return a result. Ensure these functions are compatible with the OTP-based session (keyed by email principal or stored identity).",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-48",
        "summary": "Create a new professional Profile page at frontend/src/pages/ProfilePage.tsx. The page must display the logged-in user's profile information (full name, email, phone, role, account status, and member since date) in a clean card-based layout. Include an inline edit form (or edit modal) allowing the user to update their name, email, and phone number. Show a non-editable section for role and account status. Add a 'Change Password / Re-verify' section with a button that triggers a new OTP to the registered email for re-authentication. Apply the emerald green / dark teal brand theme. Add a route '/profile' in App.tsx and a 'Profile' link in the sidebar navigation in Layout.tsx.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/pages/ProfilePage.tsx",
          "frontend/src/App.tsx",
          "frontend/src/components/Layout.tsx"
        ],
        "matchedFiles": [
          "frontend/src/pages/ProfilePage.tsx",
          "frontend/src/App.tsx",
          "frontend/src/components/Layout.tsx"
        ]
      },
      {
        "id": "REQ-49",
        "summary": "In frontend/src/hooks/useQueries.ts, add React Query hooks for the new OTP and profile endpoints: useGenerateOTP(email), useVerifyOTP(email, otp), useGetCallerUserProfile, and useUpdateCallerUserProfile. Ensure these hooks use a freshly obtained actor reference at call time (not a stale closure). Handle loading, success, and error states and invalidate relevant queries on mutation success.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/hooks/useQueries.ts"
        ],
        "matchedFiles": [
          "frontend/src/hooks/useQueries.ts"
        ]
      }
    ]
  },
  "changedFiles": [
    "backend/main.mo",
    "backend/migration.mo",
    "build-request.json",
    "feature_evidence.json",
    "frontend-file-summaries.txt",
    "frontend-implementation-plan.json",
    "frontend/src/App.tsx",
    "frontend/src/backend.d.ts",
    "frontend/src/backend.ts",
    "frontend/src/components/Layout.tsx",
    "frontend/src/components/ProfileSetupModal.tsx",
    "frontend/src/declarations/backend.did.d.ts",
    "frontend/src/declarations/backend.did.js",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/LoginPage.tsx",
    "frontend/src/pages/ProfilePage.tsx",
    "project_state.json",
    "scratch/component-selection.json",
    "spec.md",
    "spec_vs_diff_report.json"
  ]
}