{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix sidebar visibility, remove Refer & Earn, implement real backend data, and enable all action buttons",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix sidebar text and icon visibility to ensure all navigation labels render in white or light-colored text against the purple background",
      "acceptanceCriteria": [
        "All sidebar menu item labels are white or light-colored and clearly legible against the purple background",
        "Icons beside each menu item are also light-colored and visible",
        "Active/selected menu item has a visually distinct highlight that remains readable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update sidebar styling to ensure all navigation text and icons use white or light colors (text-white, text-gray-100, or similar Tailwind classes) for visibility against the purple background. Update active/selected state styling to maintain readability with a distinct highlight (e.g., bg-white/10 or bg-purple-600). Remove any dark text classes (text-gray-600, text-gray-900) from sidebar navigation items."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the 'Refer & Earn' menu item completely from the sidebar navigation",
      "acceptanceCriteria": [
        "Sidebar does not contain a 'Refer & Earn' link or section",
        "Remaining sidebar items are: Dashboard, Contacts, Pipeline, Templates, Reports, Other Services, Admin, Settings, Sign Out"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Remove the 'Refer & Earn' navigation item and its associated Link component from the sidebar menu. Ensure the sidebar contains only: Dashboard, Contacts, Pipeline, Templates, Reports, Other Services, Admin, Settings, and Sign Out."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Dashboard must display only real data fetched from the backend, starting at 0 when no data exists and updating automatically as data is added",
      "acceptanceCriteria": [
        "Dashboard shows 0 for all counters and charts on a fresh start with no data",
        "After adding a lead or deal, the dashboard stats reflect the new totals without a full page reload",
        "No hardcoded or sample/mock data is displayed on the dashboard"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Replace any hardcoded or sample data with real backend queries using useGetAllLeads and useGetAllDeals hooks. Calculate metrics (lead count, deal count, pipeline stats) from fetched data. Ensure counters start at 0 when no data exists. Remove any mock data constants or sample data usage. Display loading states while data is being fetched."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Pipeline page must display only deals that have been actually added by the user, starting empty and updating automatically when new deals are added",
      "acceptanceCriteria": [
        "Pipeline board is empty when no deals have been added",
        "Deals appear in the correct stage column after being added",
        "No hardcoded or sample deals are shown",
        "Moving a deal between stages updates the backend and is reflected immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DealsPage.tsx",
          "operation": "modify",
          "description": "Ensure the page uses useGetAllDeals hook to fetch real backend data. Remove any hardcoded or sample deal data. Group deals by stage (New, In Progress, Won, Lost) from the fetched data. Ensure the board displays empty columns when no deals exist for a stage. Verify that drag-and-drop or move-stage actions trigger the useMoveDealStage mutation and refetch deals to reflect changes immediately."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Make all action buttons fully functional: 'Add Contact', 'Add Lead', 'Add Deal', and other create/edit/delete buttons must work correctly",
      "acceptanceCriteria": [
        "Clicking 'Add Contact' opens the contact/lead form dialog and successfully saves to the backend",
        "Clicking 'Add Deal' opens the deal form dialog and successfully saves to the backend",
        "Edit and delete buttons on leads, contacts, and deals all work correctly",
        "Success/error toast notifications appear after form submissions",
        "Lists and counters update immediately after any create/edit/delete action"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactsPage.tsx",
          "operation": "modify",
          "description": "Verify that the 'Add Lead' button is wired to open the AddLeadModal component. Ensure the modal's form submission calls the useAddLead mutation hook and displays a success toast on completion. Ensure the page refetches lead data after successful submission to reflect new leads immediately."
        },
        {
          "path": "frontend/src/pages/LeadsPage.tsx",
          "operation": "modify",
          "description": "Verify that the 'Add Lead' button is wired to open the LeadFormDialog component. Ensure edit buttons on lead cards open the LeadFormDialog with pre-filled data. Verify delete buttons open the DeleteConfirmationDialog and call the useDeleteLead mutation. Ensure all mutations trigger toast notifications and refetch lead data to update the UI immediately."
        },
        {
          "path": "frontend/src/pages/DealsPage.tsx",
          "operation": "modify",
          "description": "Verify that the 'Add Deal' button is wired to open the DealFormDialog component. Ensure edit and delete actions on deal cards (via DealCard component dropdown) trigger the correct mutations (useUpdateDeal, useDeleteDeal). Verify that all mutations display toast notifications and refetch deal data to update the pipeline board immediately."
        },
        {
          "path": "frontend/src/components/AddLeadModal.tsx",
          "operation": "modify",
          "description": "Ensure the form submit handler calls the useAddLead mutation hook with correct field values (name, contact, status, notes). Verify toast notifications are displayed on success and error. Ensure the modal closes and the parent page refetches data after successful submission."
        },
        {
          "path": "frontend/src/components/LeadFormDialog.tsx",
          "operation": "modify",
          "description": "Ensure the form submit handler calls either useAddLead (for new leads) or useUpdateLead (for editing) mutation hooks with correct field values. Verify toast notifications are displayed on success and error. Ensure the dialog closes and the parent page refetches data after successful submission."
        },
        {
          "path": "frontend/src/components/DealFormDialog.tsx",
          "operation": "modify",
          "description": "Ensure the form submit handler calls either useAddDeal (for new deals) or useUpdateDeal (for editing) mutation hooks with correct field values (title, value, customerId, stage). Verify toast notifications are displayed on success and error. Ensure the dialog closes and the parent page refetches data after successful submission."
        },
        {
          "path": "frontend/src/components/DealCard.tsx",
          "operation": "modify",
          "description": "Verify that the edit action opens the DealFormDialog with pre-filled deal data. Verify that the delete action opens the DeleteConfirmationDialog and calls the useDeleteDeal mutation on confirmation. Verify that move-stage actions call the useMoveDealStage mutation. Ensure all actions trigger toast notifications and cause parent components to refetch data."
        }
      ]
    }
  ]
}