{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Profile Setup modal 'Unable to save profile' error",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Fix the ProfileSetupModal component to correctly invoke the backend actor's saveCallerUserProfile function with proper actor handling and error display",
      "acceptanceCriteria": [
        "Submitting the profile form with name, email, and phone successfully saves the profile and closes the modal",
        "The user is redirected to the dashboard after a successful save",
        "If the backend returns an error, the error message is displayed clearly inside the modal",
        "The actor used in the mutation is always the latest authenticated instance"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Fix the saveCallerUserProfile mutation to pass name, email, and phone as three separate string arguments (not as an object). Update the mutation call in handleSubmit to match the backend Candid signature: actor.saveCallerUserProfile(formData.name, formData.email, formData.phone). Ensure the actor is fetched fresh from useActor at mutation time. Handle both the #ok success variant and potential error results from the backend, displaying any error message clearly in the UI. On success, invalidate the currentUserProfile query and allow the Layout component to handle navigation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useSaveCallerUserProfile mutation hook to accept three separate string parameters (name: string, email: string, phone: string) instead of a UserProfile object. Ensure the mutation function calls actor.saveCallerUserProfile(name, email, phone) with these three arguments to match the backend Candid interface. Preserve all error handling and query invalidation logic."
        }
      ]
    }
  ]
}